system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs (sampling);
writeControl onEnd;
setFormat csv;
fields (U);
interpolationScheme cellPoint;

sets
{
    x906.8
    {
        type uniform;
        axis y;
        start (906.8 0 0);
        end (906.8 26.49 0);
        nPoints 448;
    }
}
